app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Hullo test 4"], ["body", "Hullo, this is test 4"], ["created_at", "2020-10-12 22:20:16.338067"], ["updated_at", "2020-10-12 22:20:16.338067"], ["user_id", 2]]